Config = {}

Config.RequiredJob = "lumberjack"
Config.PedModel = `a_m_m_farmer_01`
Config.JobLocation = vec4(2221.81, 5614.72, 53.9, 105.52)

-- მაღაზიის ნივთების დინამიკური სია
Config.ShopItems = {
    {
        label = "ინდუსტრიული ნაჯახი",
        item = "WEAPON_BATTLEAXE",
        price = 10,
        description = "გამძლეობა: 3 გამოყენება",
        icon = "fa-solid fa-axe"
    },
    {
        label = "ბურგერი",
        item = "burger",
        price = 50,
        description = "ჭამე ამოხეთქვამდე",
        icon = "fa-solid fa-briefcase"
    },
    {
        label = "სასმელი წყალი",
        item = "water",
        price = 50,
        description = "წყურვილის მოსაკლავად",
        icon = "fa-solid fa-briefcase"
    }
}

-- ძველი პარამეტრები თავსებადობისთვის
Config.AxeItemName = "WEAPON_BATTLEAXE"
Config.AxeMaxUses = 20

Config.Blips = {
    Hub = { 
        coords = vec3(2221.81, 5614.72, 53.9), 
        sprite = 566, 
        color = 5, 
        scale = 0.8, 
        label = "ხისმჭრელის ჰაბი" 
    }
}

Config.TreeLocations = {
    vec3(2286.47, 5612.05, 54.03), vec3(2280.58, 5596.08, 51.06),
    vec3(2263.51, 5587.44, 51.95), vec3(2250.33, 5586.97, 52.41),
    vec3(2250.88, 5609.8, 52.93), vec3(2256.94, 5621.48, 53.62),
    vec3(2262.27, 5608.55, 53.55), vec3(2290.52, 5568.7, 38.46),
    vec3(2280.68, 5541.19, 49.98), vec3(2293.82, 5539.67, 49.89),
    vec3(2313.34, 5532.33, 50.18), vec3(2326.45, 5527.07, 50.31),
    vec3(2346.33, 5516.52, 50.71), vec3(2364.38, 5537.74, 45.45),
    vec3(2344.01, 5544.71, 46.17), vec3(2324.48, 5544.18, 47.1),
    vec3(2329.37, 5575.01, 41.83), vec3(2270.86, 5621.28, 55.31),
    vec3(2256.28, 5596.71, 52.56), vec3(2206.08, 5632.55, 55.6),
    vec3(2212.7, 5604.92, 52.75), vec3(2207.84, 5583.1, 52.95),
    vec3(2197.79, 5570.58, 52.86), vec3(2200.75, 5587.0, 52.95),
    vec3(2338.01, 5532.35, 48.93), vec3(2376.78, 5514.02, 49.29),
    vec3(2365.79, 5505.07, 50.83), vec3(2383.88, 5498.68, 50.77),
    vec3(2396.67, 5480.26, 50.57), vec3(2201.4, 5562.31, 52.9),
    vec3(2206.21, 5563.31, 52.82), vec3(2203.97, 5571.27, 52.68),
    vec3(2211.59, 5571.92, 52.84), vec3(2198.81, 5580.22, 52.83)
}

Config.Tree = {
    model = `prop_tree_pine_01`,
    stump = `prop_tree_stump_01`,
}

Config.GrowthTime = 240000